posts/Golang Guards.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-29 Thu 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Golang Guards</title>
<meta name="author" content="FreeBirdLjj" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/assets/css/predefined.css" />
<link rel="stylesheet" type="text/css" href="/assets/css/worg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://freebirdljj.github.io"> UP </a>
 |
 <a accesskey="H" href="https://freebirdljj.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Golang Guards</h1>
<p>
golang 的 <code>defer</code> 机制用来在函数返回时执行清理操作。
本文讲述的小技巧是利用返回类型为 <code>func()</code> 的函数作为 guard function。
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">guard</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Guarding..."</span><span style="color: #bc6ec5;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span> fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Leaving..."</span><span style="color: #2d9574;">)</span> <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">f</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">defer</span> <span style="color: #bc6ec5; font-weight: bold;">guard</span><span style="color: #bc6ec5;">()()</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Do something..."</span><span style="color: #bc6ec5;">)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
<code>f()</code> 运行的输出是
</p>

<div class="org-src-container">
<pre class="src src-shell">Guarding...
Do something...
Leaving...
</pre>
</div>

<p>
这样的函数作 guard 尤为方便，比如用来实现类似 C++ 的 <code>std::lock_guard</code> ：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">LockGuard</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">m</span> *<span style="color: #ce537a; font-weight: bold;">sync.Mutex</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">func</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
        m.<span style="color: #bc6ec5; font-weight: bold;">Lock</span><span style="color: #bc6ec5;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> m.Unlock
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
之所以说是“类似”，是因为 C++ 中析构函数在离开当前作用域时被调用，而 golang 的 <code>defer</code> 则是在离开函数的时候被调用，生命周期有一点区别。
</p>
</div>
</body>
</html>
